# MEMBENTUK DUMMY DATA FRAME ###

### Import Modules ##

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

## Membentuk Data Frame Dari Dictionary #

In [2]:
pd.DataFrame({'col1':[1, 2, 3, 4],
             'col2':[5, 6 ,7 , 8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

### Membentuk Data Frame Dari Numpy Array ##

In [4]:
n_rows = 5
n_cols = 3


arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[13,  6,  3],
       [ 9, 11, 18],
       [16, 14, 12],
       [17, 11,  1],
       [ 6,  6, 19]])

In [5]:
pd.DataFrame(arr, columns=tuple('ABC')) # tuple untuk memberi label setiap kolomnya

    A   B   C
0  13   6   3
1   9  11  18
2  16  14  12
3  17  11   1
4   6   6  19

## Membentuk Data Frame Dengan Memanfaatkan pandas.util.testing ###

In [6]:
pd.util.testing.makeDataFrame().head() #head hanya menampilkan 5 data pertama

C:\Users\Velin\anaconda3\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                   A         B         C         D
W7d3MOxxnV -0.275856  0.144822  1.094954  0.574734
5QB7z4RyMI  0.877218 -1.054176  1.414574  1.505703
V017nZyASr  1.694290 -1.002049  1.027036 -1.414731
Quu1axzotb -0.682984  0.933770  0.922695 -0.577009
IseT4byUfz  0.660413  0.659451  1.205643  0.635443

In [8]:
pd.util.testing.makeMixedDataFrame().head() # Data Campur

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [11]:
pd.util.testing.makeTimeDataFrame().head() # Data Waktu

                   A         B         C         D
2000-01-03  3.017098  0.536391  1.511231  0.841781
2000-01-04  0.337605  0.820902  1.727555  0.200707
2000-01-05  0.378110 -1.903178  1.125084  0.610952
2000-01-06 -0.729237 -1.086445 -0.212243 -0.456648
2000-01-07 -1.740158 -1.143537  0.983977  1.384829

In [13]:
pd.util.testing.makeMissingDataframe().head() # Data Hilang

                   A         B         C         D
02UwaiuPFh -0.217557  2.360722  0.721464  0.546330
vWzbEhoe7e -0.539040  0.154163 -1.505616  0.769950
tmIHUxecPE       NaN -0.419988 -0.082661 -0.309131
IRgb58i8ui       NaN  0.881514       NaN -0.793459
5deL12LnLa -2.159759 -1.833331 -0.167588  0.418452

2173004_Velinda Novelia Candra